opends/tests/staf-tests/functional-tests/shared/data/dsml/suites/09modDNsuite/data/moddn000.dat

POST /dsml HTTP/1.1
Host: Hoder
Connection: Close
Content-Length: 510
SOAPAction: "#batchRequest"

<?xml version='1.0' encoding='UTF-8'?>
  <soap-env:Envelope
      xmlns:xsd='http://www.w3.org/2001/XMLSchema'
      xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
      xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'>
  <soap-env:Body>
  <batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core">
     <modDNRequest dn="uid=prose, ou=People, o=dsmlfe.com" newrdn="uid=thisisaminoradjustment" deleteoldrdn="true">
     </modDNRequest>
  </batchRequest>
  </soap-env:Body>
  </soap-env:Envelope>
